# Cable Size Other Conductor Size Property

Source: https://www.revitapidocs.com/2026/af6629d6-624b-6f15-9fe8-6916390289dd.htm

---

| Cable Size Other Conductor Size Property |
| --- |

The size of an Other Conductor.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId OtherConductorSize { get; set; }
```

```
Public Property OtherConductorSize As ElementId
	Get
	Set
```

```
public:
property ElementId^ OtherConductorSize {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

```
member OtherConductorSize : ElementId with get, set
```

#### Property Value

ElementId Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The id is not a Conductor Size id nor invalidElementId. |
| ArgumentNullException | When setting this property: A non\-optional argument was null |

Remarks Each Other Conductor has the same size. See Also

#### Reference

CableSize Class Autodesk.Revit.DB.Electrical Namespace